espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_csi_host_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** CSI_HOST_VERSION_REG register
 *  NA
 */
#define CSI_HOST_VERSION_REG (DR_REG_CSI_HOST_BASE + 0x0)
/** CSI_HOST_VERSION : RO; bitpos: [31:0]; default: 825569322;
 *  NA
 */
#define CSI_HOST_VERSION    0xFFFFFFFFU
#define CSI_HOST_VERSION_M  (CSI_HOST_VERSION_V << CSI_HOST_VERSION_S)
#define CSI_HOST_VERSION_V  0xFFFFFFFFU
#define CSI_HOST_VERSION_S  0

/** CSI_HOST_N_LANES_REG register
 *  NA
 */
#define CSI_HOST_N_LANES_REG (DR_REG_CSI_HOST_BASE + 0x4)
/** CSI_HOST_N_LANES : R/W; bitpos: [2:0]; default: 1;
 *  NA
 */
#define CSI_HOST_N_LANES    0x00000007U
#define CSI_HOST_N_LANES_M  (CSI_HOST_N_LANES_V << CSI_HOST_N_LANES_S)
#define CSI_HOST_N_LANES_V  0x00000007U
#define CSI_HOST_N_LANES_S  0

/** CSI_HOST_CSI2_RESETN_REG register
 *  NA
 */
#define CSI_HOST_CSI2_RESETN_REG (DR_REG_CSI_HOST_BASE + 0x8)
/** CSI_HOST_CSI2_RESETN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_CSI2_RESETN    (BIT(0))
#define CSI_HOST_CSI2_RESETN_M  (CSI_HOST_CSI2_RESETN_V << CSI_HOST_CSI2_RESETN_S)
#define CSI_HOST_CSI2_RESETN_V  0x00000001U
#define CSI_HOST_CSI2_RESETN_S  0

/** CSI_HOST_INT_ST_MAIN_REG register
 *  NA
 */
#define CSI_HOST_INT_ST_MAIN_REG (DR_REG_CSI_HOST_BASE + 0xc)
/** CSI_HOST_ST_STATUS_INT_PHY_FATAL : RC; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_PHY_FATAL    (BIT(0))
#define CSI_HOST_ST_STATUS_INT_PHY_FATAL_M  (CSI_HOST_ST_STATUS_INT_PHY_FATAL_V << CSI_HOST_ST_STATUS_INT_PHY_FATAL_S)
#define CSI_HOST_ST_STATUS_INT_PHY_FATAL_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_PHY_FATAL_S  0
/** CSI_HOST_ST_STATUS_INT_PKT_FATAL : RC; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_PKT_FATAL    (BIT(1))
#define CSI_HOST_ST_STATUS_INT_PKT_FATAL_M  (CSI_HOST_ST_STATUS_INT_PKT_FATAL_V << CSI_HOST_ST_STATUS_INT_PKT_FATAL_S)
#define CSI_HOST_ST_STATUS_INT_PKT_FATAL_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_PKT_FATAL_S  1
/** CSI_HOST_ST_STATUS_INT_BNDRY_FRAME_FATAL : RC; bitpos: [2]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_BNDRY_FRAME_FATAL    (BIT(2))
#define CSI_HOST_ST_STATUS_INT_BNDRY_FRAME_FATAL_M  (CSI_HOST_ST_STATUS_INT_BNDRY_FRAME_FATAL_V << CSI_HOST_ST_STATUS_INT_BNDRY_FRAME_FATAL_S)
#define CSI_HOST_ST_STATUS_INT_BNDRY_FRAME_FATAL_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_BNDRY_FRAME_FATAL_S  2
/** CSI_HOST_ST_STATUS_INT_SEQ_FRAME_FATAL : RC; bitpos: [3]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_SEQ_FRAME_FATAL    (BIT(3))
#define CSI_HOST_ST_STATUS_INT_SEQ_FRAME_FATAL_M  (CSI_HOST_ST_STATUS_INT_SEQ_FRAME_FATAL_V << CSI_HOST_ST_STATUS_INT_SEQ_FRAME_FATAL_S)
#define CSI_HOST_ST_STATUS_INT_SEQ_FRAME_FATAL_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_SEQ_FRAME_FATAL_S  3
/** CSI_HOST_ST_STATUS_INT_CRC_FRAME_FATAL : RC; bitpos: [4]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_CRC_FRAME_FATAL    (BIT(4))
#define CSI_HOST_ST_STATUS_INT_CRC_FRAME_FATAL_M  (CSI_HOST_ST_STATUS_INT_CRC_FRAME_FATAL_V << CSI_HOST_ST_STATUS_INT_CRC_FRAME_FATAL_S)
#define CSI_HOST_ST_STATUS_INT_CRC_FRAME_FATAL_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_CRC_FRAME_FATAL_S  4
/** CSI_HOST_ST_STATUS_INT_PLD_CRC_FATAL : RC; bitpos: [5]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_PLD_CRC_FATAL    (BIT(5))
#define CSI_HOST_ST_STATUS_INT_PLD_CRC_FATAL_M  (CSI_HOST_ST_STATUS_INT_PLD_CRC_FATAL_V << CSI_HOST_ST_STATUS_INT_PLD_CRC_FATAL_S)
#define CSI_HOST_ST_STATUS_INT_PLD_CRC_FATAL_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_PLD_CRC_FATAL_S  5
/** CSI_HOST_ST_STATUS_INT_DATA_ID : RC; bitpos: [6]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_DATA_ID    (BIT(6))
#define CSI_HOST_ST_STATUS_INT_DATA_ID_M  (CSI_HOST_ST_STATUS_INT_DATA_ID_V << CSI_HOST_ST_STATUS_INT_DATA_ID_S)
#define CSI_HOST_ST_STATUS_INT_DATA_ID_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_DATA_ID_S  6
/** CSI_HOST_ST_STATUS_INT_ECC_CORRECTED : RC; bitpos: [7]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_ECC_CORRECTED    (BIT(7))
#define CSI_HOST_ST_STATUS_INT_ECC_CORRECTED_M  (CSI_HOST_ST_STATUS_INT_ECC_CORRECTED_V << CSI_HOST_ST_STATUS_INT_ECC_CORRECTED_S)
#define CSI_HOST_ST_STATUS_INT_ECC_CORRECTED_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_ECC_CORRECTED_S  7
/** CSI_HOST_ST_STATUS_INT_PHY : RC; bitpos: [16]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_STATUS_INT_PHY    (BIT(16))
#define CSI_HOST_ST_STATUS_INT_PHY_M  (CSI_HOST_ST_STATUS_INT_PHY_V << CSI_HOST_ST_STATUS_INT_PHY_S)
#define CSI_HOST_ST_STATUS_INT_PHY_V  0x00000001U
#define CSI_HOST_ST_STATUS_INT_PHY_S  16

/** CSI_HOST_PHY_SHUTDOWNZ_REG register
 *  NA
 */
#define CSI_HOST_PHY_SHUTDOWNZ_REG (DR_REG_CSI_HOST_BASE + 0x40)
/** CSI_HOST_PHY_SHUTDOWNZ : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_SHUTDOWNZ    (BIT(0))
#define CSI_HOST_PHY_SHUTDOWNZ_M  (CSI_HOST_PHY_SHUTDOWNZ_V << CSI_HOST_PHY_SHUTDOWNZ_S)
#define CSI_HOST_PHY_SHUTDOWNZ_V  0x00000001U
#define CSI_HOST_PHY_SHUTDOWNZ_S  0

/** CSI_HOST_DPHY_RSTZ_REG register
 *  NA
 */
#define CSI_HOST_DPHY_RSTZ_REG (DR_REG_CSI_HOST_BASE + 0x44)
/** CSI_HOST_DPHY_RSTZ : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_DPHY_RSTZ    (BIT(0))
#define CSI_HOST_DPHY_RSTZ_M  (CSI_HOST_DPHY_RSTZ_V << CSI_HOST_DPHY_RSTZ_S)
#define CSI_HOST_DPHY_RSTZ_V  0x00000001U
#define CSI_HOST_DPHY_RSTZ_S  0

/** CSI_HOST_PHY_RX_REG register
 *  NA
 */
#define CSI_HOST_PHY_RX_REG (DR_REG_CSI_HOST_BASE + 0x48)
/** CSI_HOST_PHY_RXULPSESC_0 : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_RXULPSESC_0    (BIT(0))
#define CSI_HOST_PHY_RXULPSESC_0_M  (CSI_HOST_PHY_RXULPSESC_0_V << CSI_HOST_PHY_RXULPSESC_0_S)
#define CSI_HOST_PHY_RXULPSESC_0_V  0x00000001U
#define CSI_HOST_PHY_RXULPSESC_0_S  0
/** CSI_HOST_PHY_RXULPSESC_1 : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_RXULPSESC_1    (BIT(1))
#define CSI_HOST_PHY_RXULPSESC_1_M  (CSI_HOST_PHY_RXULPSESC_1_V << CSI_HOST_PHY_RXULPSESC_1_S)
#define CSI_HOST_PHY_RXULPSESC_1_V  0x00000001U
#define CSI_HOST_PHY_RXULPSESC_1_S  1
/** CSI_HOST_PHY_RXULPSCLKNOT : RO; bitpos: [16]; default: 1;
 *  NA
 */
#define CSI_HOST_PHY_RXULPSCLKNOT    (BIT(16))
#define CSI_HOST_PHY_RXULPSCLKNOT_M  (CSI_HOST_PHY_RXULPSCLKNOT_V << CSI_HOST_PHY_RXULPSCLKNOT_S)
#define CSI_HOST_PHY_RXULPSCLKNOT_V  0x00000001U
#define CSI_HOST_PHY_RXULPSCLKNOT_S  16
/** CSI_HOST_PHY_RXCLKACTIVEHS : RO; bitpos: [17]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_RXCLKACTIVEHS    (BIT(17))
#define CSI_HOST_PHY_RXCLKACTIVEHS_M  (CSI_HOST_PHY_RXCLKACTIVEHS_V << CSI_HOST_PHY_RXCLKACTIVEHS_S)
#define CSI_HOST_PHY_RXCLKACTIVEHS_V  0x00000001U
#define CSI_HOST_PHY_RXCLKACTIVEHS_S  17

