espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_csi_host_reg.h
/** CSI_HOST_PHY_STOPSTATE_REG register
 *  NA
 */
#define CSI_HOST_PHY_STOPSTATE_REG (DR_REG_CSI_HOST_BASE + 0x4c)
/** CSI_HOST_PHY_STOPSTATEDATA_0 : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_STOPSTATEDATA_0    (BIT(0))
#define CSI_HOST_PHY_STOPSTATEDATA_0_M  (CSI_HOST_PHY_STOPSTATEDATA_0_V << CSI_HOST_PHY_STOPSTATEDATA_0_S)
#define CSI_HOST_PHY_STOPSTATEDATA_0_V  0x00000001U
#define CSI_HOST_PHY_STOPSTATEDATA_0_S  0
/** CSI_HOST_PHY_STOPSTATEDATA_1 : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_STOPSTATEDATA_1    (BIT(1))
#define CSI_HOST_PHY_STOPSTATEDATA_1_M  (CSI_HOST_PHY_STOPSTATEDATA_1_V << CSI_HOST_PHY_STOPSTATEDATA_1_S)
#define CSI_HOST_PHY_STOPSTATEDATA_1_V  0x00000001U
#define CSI_HOST_PHY_STOPSTATEDATA_1_S  1
/** CSI_HOST_PHY_STOPSTATECLK : RO; bitpos: [16]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_STOPSTATECLK    (BIT(16))
#define CSI_HOST_PHY_STOPSTATECLK_M  (CSI_HOST_PHY_STOPSTATECLK_V << CSI_HOST_PHY_STOPSTATECLK_S)
#define CSI_HOST_PHY_STOPSTATECLK_V  0x00000001U
#define CSI_HOST_PHY_STOPSTATECLK_S  16

/** CSI_HOST_PHY_TEST_CTRL0_REG register
 *  NA
 */
#define CSI_HOST_PHY_TEST_CTRL0_REG (DR_REG_CSI_HOST_BASE + 0x50)
/** CSI_HOST_PHY_TESTCLR : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define CSI_HOST_PHY_TESTCLR    (BIT(0))
#define CSI_HOST_PHY_TESTCLR_M  (CSI_HOST_PHY_TESTCLR_V << CSI_HOST_PHY_TESTCLR_S)
#define CSI_HOST_PHY_TESTCLR_V  0x00000001U
#define CSI_HOST_PHY_TESTCLR_S  0
/** CSI_HOST_PHY_TESTCLK : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_TESTCLK    (BIT(1))
#define CSI_HOST_PHY_TESTCLK_M  (CSI_HOST_PHY_TESTCLK_V << CSI_HOST_PHY_TESTCLK_S)
#define CSI_HOST_PHY_TESTCLK_V  0x00000001U
#define CSI_HOST_PHY_TESTCLK_S  1

/** CSI_HOST_PHY_TEST_CTRL1_REG register
 *  NA
 */
#define CSI_HOST_PHY_TEST_CTRL1_REG (DR_REG_CSI_HOST_BASE + 0x54)
/** CSI_HOST_PHY_TESTDIN : R/W; bitpos: [7:0]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_TESTDIN    0x000000FFU
#define CSI_HOST_PHY_TESTDIN_M  (CSI_HOST_PHY_TESTDIN_V << CSI_HOST_PHY_TESTDIN_S)
#define CSI_HOST_PHY_TESTDIN_V  0x000000FFU
#define CSI_HOST_PHY_TESTDIN_S  0
/** CSI_HOST_PHY_TESTDOUT : RO; bitpos: [15:8]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_TESTDOUT    0x000000FFU
#define CSI_HOST_PHY_TESTDOUT_M  (CSI_HOST_PHY_TESTDOUT_V << CSI_HOST_PHY_TESTDOUT_S)
#define CSI_HOST_PHY_TESTDOUT_V  0x000000FFU
#define CSI_HOST_PHY_TESTDOUT_S  8
/** CSI_HOST_PHY_TESTEN : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define CSI_HOST_PHY_TESTEN    (BIT(16))
#define CSI_HOST_PHY_TESTEN_M  (CSI_HOST_PHY_TESTEN_V << CSI_HOST_PHY_TESTEN_S)
#define CSI_HOST_PHY_TESTEN_V  0x00000001U
#define CSI_HOST_PHY_TESTEN_S  16

/** CSI_HOST_VC_EXTENSION_REG register
 *  NA
 */
#define CSI_HOST_VC_EXTENSION_REG (DR_REG_CSI_HOST_BASE + 0xc8)
/** CSI_HOST_VCX : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_VCX    (BIT(0))
#define CSI_HOST_VCX_M  (CSI_HOST_VCX_V << CSI_HOST_VCX_S)
#define CSI_HOST_VCX_V  0x00000001U
#define CSI_HOST_VCX_S  0

/** CSI_HOST_PHY_CAL_REG register
 *  NA
 */
#define CSI_HOST_PHY_CAL_REG (DR_REG_CSI_HOST_BASE + 0xcc)
/** CSI_HOST_RXSKEWCALHS : RC; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_RXSKEWCALHS    (BIT(0))
#define CSI_HOST_RXSKEWCALHS_M  (CSI_HOST_RXSKEWCALHS_V << CSI_HOST_RXSKEWCALHS_S)
#define CSI_HOST_RXSKEWCALHS_V  0x00000001U
#define CSI_HOST_RXSKEWCALHS_S  0

/** CSI_HOST_INT_ST_PHY_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_ST_PHY_FATAL_REG (DR_REG_CSI_HOST_BASE + 0xe0)
/** CSI_HOST_ST_PHY_ERRSOTSYNCHS_0 : RC; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_0    (BIT(0))
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_0_M  (CSI_HOST_ST_PHY_ERRSOTSYNCHS_0_V << CSI_HOST_ST_PHY_ERRSOTSYNCHS_0_S)
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_0_V  0x00000001U
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_0_S  0
/** CSI_HOST_ST_PHY_ERRSOTSYNCHS_1 : RC; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_1    (BIT(1))
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_1_M  (CSI_HOST_ST_PHY_ERRSOTSYNCHS_1_V << CSI_HOST_ST_PHY_ERRSOTSYNCHS_1_S)
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_1_V  0x00000001U
#define CSI_HOST_ST_PHY_ERRSOTSYNCHS_1_S  1

/** CSI_HOST_INT_MSK_PHY_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_MSK_PHY_FATAL_REG (DR_REG_CSI_HOST_BASE + 0xe4)
/** CSI_HOST_MASK_PHY_ERRSOTSYNCHS_0 : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_0    (BIT(0))
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_0_M  (CSI_HOST_MASK_PHY_ERRSOTSYNCHS_0_V << CSI_HOST_MASK_PHY_ERRSOTSYNCHS_0_S)
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_0_V  0x00000001U
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_0_S  0
/** CSI_HOST_MASK_PHY_ERRSOTSYNCHS_1 : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_1    (BIT(1))
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_1_M  (CSI_HOST_MASK_PHY_ERRSOTSYNCHS_1_V << CSI_HOST_MASK_PHY_ERRSOTSYNCHS_1_S)
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_1_V  0x00000001U
#define CSI_HOST_MASK_PHY_ERRSOTSYNCHS_1_S  1

/** CSI_HOST_INT_FORCE_PHY_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_FORCE_PHY_FATAL_REG (DR_REG_CSI_HOST_BASE + 0xe8)
/** CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_0 : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_0    (BIT(0))
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_0_M  (CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_0_V << CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_0_S)
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_0_V  0x00000001U
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_0_S  0
/** CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_1 : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_1    (BIT(1))
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_1_M  (CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_1_V << CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_1_S)
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_1_V  0x00000001U
#define CSI_HOST_FORCE_PHY_ERRSOTSYNCHS_1_S  1

/** CSI_HOST_INT_ST_PKT_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_ST_PKT_FATAL_REG (DR_REG_CSI_HOST_BASE + 0xf0)
/** CSI_HOST_ST_ERR_ECC_DOUBLE : RC; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_ECC_DOUBLE    (BIT(0))
#define CSI_HOST_ST_ERR_ECC_DOUBLE_M  (CSI_HOST_ST_ERR_ECC_DOUBLE_V << CSI_HOST_ST_ERR_ECC_DOUBLE_S)
#define CSI_HOST_ST_ERR_ECC_DOUBLE_V  0x00000001U
#define CSI_HOST_ST_ERR_ECC_DOUBLE_S  0
/** CSI_HOST_ST_SHORTER_PAYLOAD : RC; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_SHORTER_PAYLOAD    (BIT(1))
#define CSI_HOST_ST_SHORTER_PAYLOAD_M  (CSI_HOST_ST_SHORTER_PAYLOAD_V << CSI_HOST_ST_SHORTER_PAYLOAD_S)
#define CSI_HOST_ST_SHORTER_PAYLOAD_V  0x00000001U
#define CSI_HOST_ST_SHORTER_PAYLOAD_S  1

