espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/mipi_csi_host_reg.h
/** CSI_HOST_INT_FORCE_BNDRY_FRAME_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_FORCE_BNDRY_FRAME_FATAL_REG (DR_REG_CSI_HOST_BASE + 0x288)
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC0 : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC0    (BIT(0))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC0_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC0_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC0_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC0_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC0_S  0
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC1 : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC1    (BIT(1))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC1_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC1_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC1_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC1_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC1_S  1
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC2 : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC2    (BIT(2))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC2_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC2_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC2_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC2_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC2_S  2
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC3 : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC3    (BIT(3))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC3_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC3_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC3_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC3_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC3_S  3
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC4 : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC4    (BIT(4))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC4_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC4_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC4_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC4_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC4_S  4
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC5 : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC5    (BIT(5))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC5_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC5_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC5_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC5_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC5_S  5
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC6 : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC6    (BIT(6))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC6_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC6_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC6_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC6_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC6_S  6
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC7 : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC7    (BIT(7))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC7_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC7_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC7_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC7_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC7_S  7
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC8 : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC8    (BIT(8))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC8_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC8_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC8_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC8_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC8_S  8
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC9 : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC9    (BIT(9))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC9_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC9_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC9_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC9_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC9_S  9
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC10 : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC10    (BIT(10))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC10_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC10_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC10_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC10_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC10_S  10
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC11 : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC11    (BIT(11))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC11_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC11_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC11_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC11_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC11_S  11
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC12 : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC12    (BIT(12))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC12_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC12_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC12_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC12_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC12_S  12
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC13 : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC13    (BIT(13))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC13_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC13_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC13_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC13_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC13_S  13
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC14 : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC14    (BIT(14))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC14_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC14_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC14_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC14_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC14_S  14
/** CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC15 : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC15    (BIT(15))
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC15_M  (CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC15_V << CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC15_S)
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC15_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_BNDRY_MATCH_VC15_S  15

/** CSI_HOST_INT_ST_SEQ_FRAME_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_ST_SEQ_FRAME_FATAL_REG (DR_REG_CSI_HOST_BASE + 0x290)
/** CSI_HOST_ST_ERR_F_SEQ_VC0 : RC; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC0    (BIT(0))
#define CSI_HOST_ST_ERR_F_SEQ_VC0_M  (CSI_HOST_ST_ERR_F_SEQ_VC0_V << CSI_HOST_ST_ERR_F_SEQ_VC0_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC0_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC0_S  0
/** CSI_HOST_ST_ERR_F_SEQ_VC1 : RC; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC1    (BIT(1))
#define CSI_HOST_ST_ERR_F_SEQ_VC1_M  (CSI_HOST_ST_ERR_F_SEQ_VC1_V << CSI_HOST_ST_ERR_F_SEQ_VC1_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC1_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC1_S  1
/** CSI_HOST_ST_ERR_F_SEQ_VC2 : RC; bitpos: [2]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC2    (BIT(2))
#define CSI_HOST_ST_ERR_F_SEQ_VC2_M  (CSI_HOST_ST_ERR_F_SEQ_VC2_V << CSI_HOST_ST_ERR_F_SEQ_VC2_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC2_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC2_S  2
/** CSI_HOST_ST_ERR_F_SEQ_VC3 : RC; bitpos: [3]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC3    (BIT(3))
#define CSI_HOST_ST_ERR_F_SEQ_VC3_M  (CSI_HOST_ST_ERR_F_SEQ_VC3_V << CSI_HOST_ST_ERR_F_SEQ_VC3_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC3_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC3_S  3
/** CSI_HOST_ST_ERR_F_SEQ_VC4 : RC; bitpos: [4]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC4    (BIT(4))
#define CSI_HOST_ST_ERR_F_SEQ_VC4_M  (CSI_HOST_ST_ERR_F_SEQ_VC4_V << CSI_HOST_ST_ERR_F_SEQ_VC4_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC4_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC4_S  4
/** CSI_HOST_ST_ERR_F_SEQ_VC5 : RC; bitpos: [5]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC5    (BIT(5))
#define CSI_HOST_ST_ERR_F_SEQ_VC5_M  (CSI_HOST_ST_ERR_F_SEQ_VC5_V << CSI_HOST_ST_ERR_F_SEQ_VC5_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC5_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC5_S  5
/** CSI_HOST_ST_ERR_F_SEQ_VC6 : RC; bitpos: [6]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC6    (BIT(6))
#define CSI_HOST_ST_ERR_F_SEQ_VC6_M  (CSI_HOST_ST_ERR_F_SEQ_VC6_V << CSI_HOST_ST_ERR_F_SEQ_VC6_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC6_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC6_S  6
/** CSI_HOST_ST_ERR_F_SEQ_VC7 : RC; bitpos: [7]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC7    (BIT(7))
#define CSI_HOST_ST_ERR_F_SEQ_VC7_M  (CSI_HOST_ST_ERR_F_SEQ_VC7_V << CSI_HOST_ST_ERR_F_SEQ_VC7_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC7_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC7_S  7
/** CSI_HOST_ST_ERR_F_SEQ_VC8 : RC; bitpos: [8]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC8    (BIT(8))
#define CSI_HOST_ST_ERR_F_SEQ_VC8_M  (CSI_HOST_ST_ERR_F_SEQ_VC8_V << CSI_HOST_ST_ERR_F_SEQ_VC8_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC8_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC8_S  8
/** CSI_HOST_ST_ERR_F_SEQ_VC9 : RC; bitpos: [9]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC9    (BIT(9))
#define CSI_HOST_ST_ERR_F_SEQ_VC9_M  (CSI_HOST_ST_ERR_F_SEQ_VC9_V << CSI_HOST_ST_ERR_F_SEQ_VC9_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC9_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC9_S  9
/** CSI_HOST_ST_ERR_F_SEQ_VC10 : RC; bitpos: [10]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC10    (BIT(10))
#define CSI_HOST_ST_ERR_F_SEQ_VC10_M  (CSI_HOST_ST_ERR_F_SEQ_VC10_V << CSI_HOST_ST_ERR_F_SEQ_VC10_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC10_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC10_S  10
/** CSI_HOST_ST_ERR_F_SEQ_VC11 : RC; bitpos: [11]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC11    (BIT(11))
#define CSI_HOST_ST_ERR_F_SEQ_VC11_M  (CSI_HOST_ST_ERR_F_SEQ_VC11_V << CSI_HOST_ST_ERR_F_SEQ_VC11_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC11_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC11_S  11
/** CSI_HOST_ST_ERR_F_SEQ_VC12 : RC; bitpos: [12]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC12    (BIT(12))
#define CSI_HOST_ST_ERR_F_SEQ_VC12_M  (CSI_HOST_ST_ERR_F_SEQ_VC12_V << CSI_HOST_ST_ERR_F_SEQ_VC12_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC12_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC12_S  12
/** CSI_HOST_ST_ERR_F_SEQ_VC13 : RC; bitpos: [13]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC13    (BIT(13))
#define CSI_HOST_ST_ERR_F_SEQ_VC13_M  (CSI_HOST_ST_ERR_F_SEQ_VC13_V << CSI_HOST_ST_ERR_F_SEQ_VC13_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC13_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC13_S  13
/** CSI_HOST_ST_ERR_F_SEQ_VC14 : RC; bitpos: [14]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC14    (BIT(14))
#define CSI_HOST_ST_ERR_F_SEQ_VC14_M  (CSI_HOST_ST_ERR_F_SEQ_VC14_V << CSI_HOST_ST_ERR_F_SEQ_VC14_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC14_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC14_S  14
/** CSI_HOST_ST_ERR_F_SEQ_VC15 : RC; bitpos: [15]; default: 0;
 *  NA
 */
#define CSI_HOST_ST_ERR_F_SEQ_VC15    (BIT(15))
#define CSI_HOST_ST_ERR_F_SEQ_VC15_M  (CSI_HOST_ST_ERR_F_SEQ_VC15_V << CSI_HOST_ST_ERR_F_SEQ_VC15_S)
#define CSI_HOST_ST_ERR_F_SEQ_VC15_V  0x00000001U
#define CSI_HOST_ST_ERR_F_SEQ_VC15_S  15

/** CSI_HOST_INT_MSK_SEQ_FRAME_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_MSK_SEQ_FRAME_FATAL_REG (DR_REG_CSI_HOST_BASE + 0x294)
/** CSI_HOST_MASK_ERR_F_SEQ_VC0 : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC0    (BIT(0))
#define CSI_HOST_MASK_ERR_F_SEQ_VC0_M  (CSI_HOST_MASK_ERR_F_SEQ_VC0_V << CSI_HOST_MASK_ERR_F_SEQ_VC0_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC0_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC0_S  0
/** CSI_HOST_MASK_ERR_F_SEQ_VC1 : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC1    (BIT(1))
#define CSI_HOST_MASK_ERR_F_SEQ_VC1_M  (CSI_HOST_MASK_ERR_F_SEQ_VC1_V << CSI_HOST_MASK_ERR_F_SEQ_VC1_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC1_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC1_S  1
/** CSI_HOST_MASK_ERR_F_SEQ_VC2 : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC2    (BIT(2))
#define CSI_HOST_MASK_ERR_F_SEQ_VC2_M  (CSI_HOST_MASK_ERR_F_SEQ_VC2_V << CSI_HOST_MASK_ERR_F_SEQ_VC2_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC2_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC2_S  2
/** CSI_HOST_MASK_ERR_F_SEQ_VC3 : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC3    (BIT(3))
#define CSI_HOST_MASK_ERR_F_SEQ_VC3_M  (CSI_HOST_MASK_ERR_F_SEQ_VC3_V << CSI_HOST_MASK_ERR_F_SEQ_VC3_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC3_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC3_S  3
/** CSI_HOST_MASK_ERR_F_SEQ_VC4 : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC4    (BIT(4))
#define CSI_HOST_MASK_ERR_F_SEQ_VC4_M  (CSI_HOST_MASK_ERR_F_SEQ_VC4_V << CSI_HOST_MASK_ERR_F_SEQ_VC4_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC4_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC4_S  4
/** CSI_HOST_MASK_ERR_F_SEQ_VC5 : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC5    (BIT(5))
#define CSI_HOST_MASK_ERR_F_SEQ_VC5_M  (CSI_HOST_MASK_ERR_F_SEQ_VC5_V << CSI_HOST_MASK_ERR_F_SEQ_VC5_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC5_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC5_S  5
/** CSI_HOST_MASK_ERR_F_SEQ_VC6 : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC6    (BIT(6))
#define CSI_HOST_MASK_ERR_F_SEQ_VC6_M  (CSI_HOST_MASK_ERR_F_SEQ_VC6_V << CSI_HOST_MASK_ERR_F_SEQ_VC6_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC6_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC6_S  6
/** CSI_HOST_MASK_ERR_F_SEQ_VC7 : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC7    (BIT(7))
#define CSI_HOST_MASK_ERR_F_SEQ_VC7_M  (CSI_HOST_MASK_ERR_F_SEQ_VC7_V << CSI_HOST_MASK_ERR_F_SEQ_VC7_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC7_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC7_S  7
/** CSI_HOST_MASK_ERR_F_SEQ_VC8 : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC8    (BIT(8))
#define CSI_HOST_MASK_ERR_F_SEQ_VC8_M  (CSI_HOST_MASK_ERR_F_SEQ_VC8_V << CSI_HOST_MASK_ERR_F_SEQ_VC8_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC8_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC8_S  8
/** CSI_HOST_MASK_ERR_F_SEQ_VC9 : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC9    (BIT(9))
#define CSI_HOST_MASK_ERR_F_SEQ_VC9_M  (CSI_HOST_MASK_ERR_F_SEQ_VC9_V << CSI_HOST_MASK_ERR_F_SEQ_VC9_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC9_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC9_S  9
/** CSI_HOST_MASK_ERR_F_SEQ_VC10 : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC10    (BIT(10))
#define CSI_HOST_MASK_ERR_F_SEQ_VC10_M  (CSI_HOST_MASK_ERR_F_SEQ_VC10_V << CSI_HOST_MASK_ERR_F_SEQ_VC10_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC10_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC10_S  10
/** CSI_HOST_MASK_ERR_F_SEQ_VC11 : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC11    (BIT(11))
#define CSI_HOST_MASK_ERR_F_SEQ_VC11_M  (CSI_HOST_MASK_ERR_F_SEQ_VC11_V << CSI_HOST_MASK_ERR_F_SEQ_VC11_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC11_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC11_S  11
/** CSI_HOST_MASK_ERR_F_SEQ_VC12 : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC12    (BIT(12))
#define CSI_HOST_MASK_ERR_F_SEQ_VC12_M  (CSI_HOST_MASK_ERR_F_SEQ_VC12_V << CSI_HOST_MASK_ERR_F_SEQ_VC12_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC12_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC12_S  12
/** CSI_HOST_MASK_ERR_F_SEQ_VC13 : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC13    (BIT(13))
#define CSI_HOST_MASK_ERR_F_SEQ_VC13_M  (CSI_HOST_MASK_ERR_F_SEQ_VC13_V << CSI_HOST_MASK_ERR_F_SEQ_VC13_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC13_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC13_S  13
/** CSI_HOST_MASK_ERR_F_SEQ_VC14 : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC14    (BIT(14))
#define CSI_HOST_MASK_ERR_F_SEQ_VC14_M  (CSI_HOST_MASK_ERR_F_SEQ_VC14_V << CSI_HOST_MASK_ERR_F_SEQ_VC14_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC14_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC14_S  14
/** CSI_HOST_MASK_ERR_F_SEQ_VC15 : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define CSI_HOST_MASK_ERR_F_SEQ_VC15    (BIT(15))
#define CSI_HOST_MASK_ERR_F_SEQ_VC15_M  (CSI_HOST_MASK_ERR_F_SEQ_VC15_V << CSI_HOST_MASK_ERR_F_SEQ_VC15_S)
#define CSI_HOST_MASK_ERR_F_SEQ_VC15_V  0x00000001U
#define CSI_HOST_MASK_ERR_F_SEQ_VC15_S  15

/** CSI_HOST_INT_FORCE_SEQ_FRAME_FATAL_REG register
 *  NA
 */
#define CSI_HOST_INT_FORCE_SEQ_FRAME_FATAL_REG (DR_REG_CSI_HOST_BASE + 0x298)
/** CSI_HOST_FORCE_ERR_F_SEQ_VC0 : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC0    (BIT(0))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC0_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC0_V << CSI_HOST_FORCE_ERR_F_SEQ_VC0_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC0_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC0_S  0
/** CSI_HOST_FORCE_ERR_F_SEQ_VC1 : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC1    (BIT(1))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC1_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC1_V << CSI_HOST_FORCE_ERR_F_SEQ_VC1_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC1_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC1_S  1
/** CSI_HOST_FORCE_ERR_F_SEQ_VC2 : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC2    (BIT(2))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC2_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC2_V << CSI_HOST_FORCE_ERR_F_SEQ_VC2_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC2_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC2_S  2
/** CSI_HOST_FORCE_ERR_F_SEQ_VC3 : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC3    (BIT(3))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC3_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC3_V << CSI_HOST_FORCE_ERR_F_SEQ_VC3_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC3_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC3_S  3
/** CSI_HOST_FORCE_ERR_F_SEQ_VC4 : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC4    (BIT(4))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC4_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC4_V << CSI_HOST_FORCE_ERR_F_SEQ_VC4_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC4_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC4_S  4
/** CSI_HOST_FORCE_ERR_F_SEQ_VC5 : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC5    (BIT(5))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC5_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC5_V << CSI_HOST_FORCE_ERR_F_SEQ_VC5_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC5_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC5_S  5
/** CSI_HOST_FORCE_ERR_F_SEQ_VC6 : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC6    (BIT(6))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC6_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC6_V << CSI_HOST_FORCE_ERR_F_SEQ_VC6_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC6_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC6_S  6
/** CSI_HOST_FORCE_ERR_F_SEQ_VC7 : R/W; bitpos: [7]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC7    (BIT(7))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC7_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC7_V << CSI_HOST_FORCE_ERR_F_SEQ_VC7_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC7_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC7_S  7
/** CSI_HOST_FORCE_ERR_F_SEQ_VC8 : R/W; bitpos: [8]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC8    (BIT(8))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC8_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC8_V << CSI_HOST_FORCE_ERR_F_SEQ_VC8_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC8_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC8_S  8
/** CSI_HOST_FORCE_ERR_F_SEQ_VC9 : R/W; bitpos: [9]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC9    (BIT(9))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC9_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC9_V << CSI_HOST_FORCE_ERR_F_SEQ_VC9_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC9_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC9_S  9
/** CSI_HOST_FORCE_ERR_F_SEQ_VC10 : R/W; bitpos: [10]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC10    (BIT(10))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC10_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC10_V << CSI_HOST_FORCE_ERR_F_SEQ_VC10_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC10_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC10_S  10
/** CSI_HOST_FORCE_ERR_F_SEQ_VC11 : R/W; bitpos: [11]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC11    (BIT(11))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC11_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC11_V << CSI_HOST_FORCE_ERR_F_SEQ_VC11_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC11_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC11_S  11
/** CSI_HOST_FORCE_ERR_F_SEQ_VC12 : R/W; bitpos: [12]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC12    (BIT(12))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC12_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC12_V << CSI_HOST_FORCE_ERR_F_SEQ_VC12_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC12_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC12_S  12
/** CSI_HOST_FORCE_ERR_F_SEQ_VC13 : R/W; bitpos: [13]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC13    (BIT(13))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC13_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC13_V << CSI_HOST_FORCE_ERR_F_SEQ_VC13_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC13_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC13_S  13
/** CSI_HOST_FORCE_ERR_F_SEQ_VC14 : R/W; bitpos: [14]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC14    (BIT(14))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC14_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC14_V << CSI_HOST_FORCE_ERR_F_SEQ_VC14_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC14_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC14_S  14
/** CSI_HOST_FORCE_ERR_F_SEQ_VC15 : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define CSI_HOST_FORCE_ERR_F_SEQ_VC15    (BIT(15))
#define CSI_HOST_FORCE_ERR_F_SEQ_VC15_M  (CSI_HOST_FORCE_ERR_F_SEQ_VC15_V << CSI_HOST_FORCE_ERR_F_SEQ_VC15_S)
#define CSI_HOST_FORCE_ERR_F_SEQ_VC15_V  0x00000001U
#define CSI_HOST_FORCE_ERR_F_SEQ_VC15_S  15

